myrottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "movies" SET "title" = '5t5t5t55', "updated_at" = '2012-10-28 12:15:58.137690' WHERE "movies"."id" = 21